spec/support/vcr_cassettes/hca/voa/health_check.yml

---
http_interactions:
- request:
    method: post
    uri: "<HCA-VOA_URL>"
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="UTF-8"?><soap:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:ns1="http://va.gov/schema/esr/voa/v1"
        xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tns="http://va.gov/service/esr/voa/v1"><soap:Body><ns1:retrieveFormSubmissionStatusRequest><ns1:formSubmissionId>123456789</ns1:formSubmissionId></ns1:retrieveFormSubmissionStatusRequest></soap:Body></soap:Envelope>
    headers:
      Accept:
      - text/xml;charset=UTF-8
      Content-Type:
      - text/xml;charset=UTF-8
      User-Agent:
      - Vets.gov Agent
      Date:
      - Wed, 26 Apr 2017 15:47:55 GMT
      Content-Length:
      - '472'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 26 Apr 2017 15:48:02 GMT
      Server:
      - Apache/2.4.6 (Red Hat Enterprise Linux) OpenSSL/1.0.1e-fips
      X-Powered-By:
      - Servlet/2.5 JSP/2.1
      Transfer-Encoding:
      - chunked
      Content-Type:
      - text/xml; charset=utf-8
    body:
      encoding: UTF-8
      string: <?xml version='1.0' encoding='UTF-8'?><S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/"><S:Body><retrieveFormSubmissionStatusResponse
        xmlns:ns2="http://jaxws.webservices.esr.med.va.gov/schemas" xmlns="http://va.gov/schema/esr/voa/v1"><formSubmissionId>123456789</formSubmissionId><message/><timeStamp>2016-12-12T08:06:08.423-06:00</timeStamp></retrieveFormSubmissionStatusResponse></S:Body></S:Envelope>
    http_version:
  recorded_at: Wed, 26 Apr 2017 15:47:55 GMT
recorded_with: VCR 3.0.3
